app/views/public_recipes/_public_recipe_card.html.erb

<% id = recipe.id %>
<% owner= User.find(recipe.user_id).name %>
<% foods_list = RecipeFood.where(recipe_id: id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 1]]

<% foods_list.each do |food| %>
  <% food_item = Food.find(food.food_id) %>
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]