app/views/recipes/show.html.erb

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
        <% food_idd = recipe_food.food_id %>
        <% food = Food.find(food_idd) %>

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
        <tr class=<%= classes_row[i%2] %> >
          <td> <%= Food.find(food_idd).name %> </td>