app/controllers/foods_controller.rb

  def index
    @foods = Food.where(user_id: params[:user_id])
---
SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1  [["user_id", 1]]

  def create
    @food = Food.new(food_params)
    @food.user_id = current_user.id

    if @food.save
---
INSERT INTO "foods" ("name", "measurement_unit", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Apple"], ["measurement_unit", "grams"], ["price", 5.0], ["user_id", 1], ["created_at", "2022-03-08 10:59:36.343701"], ["updated_at", "2022-03-08 10:59:36.343701"]]

  def destroy
    food = Food.find(params[:id])
    food.destroy
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 1]]

  def set_food
    Food.find(params[:id])
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]