app/controllers/public_recipes_controller.rb

  def index
    @public_recipes = Recipe.where(public: true)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."public" = $1 ORDER BY "recipes"."created_at" DESC  [["public", true]]