app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1  [["user_id", 1]]
---
  def index
    @recipes = Recipe.where(user_id: current_user.id)

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 2]]
---
  def show
    recip_id = params[:id]
    @recipe = Recipe.find(recip_id)
    render recipes_path unless ((@recipe.public == true) || (@recipe.user_id == current_user.id))
    @recipe_foods = RecipeFood.where(recipe_id: recip_id)

INSERT INTO "recipes" ("name", "preparation_time", "cooking_time", "description", "public", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.user_id = current_user.id

    if @recipe.save