app/controllers/shopping_list_controller.rb

  def index
    @recipes = Recipe.where(user_id: current_user.id)
    @missing_foods = []
    @quantity = []
    @prices = []
    inv_d = Inventory.find_by(user_id: current_user.id)
    @recipes.each do |recipe|
      rfoods = RecipeFood.where(recipe_id: recipe.id)
      rfoods.each do |f|
        rq = f.quantity
        eq = InventoryFood.find_by(food_id: f.food_id, inventory_id: inv_d).quantity
        dq = rq - eq
        if dq > 0
          @missing_foods.push(Food.find(f.food_id))
          @quantity.push(dq)
          @prices.push(dq * Food.find(f.food_id).price)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1  [["user_id", 14]]
SELECT "inventories".* FROM "inventories" WHERE "inventories"."user_id" = $1 LIMIT $2  [["user_id", 10], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1  [["user_id", 10]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 1]]
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "inventory_foods".* FROM "inventory_foods" WHERE "inventory_foods"."food_id" = $1 AND "inventory_foods"."inventory_id" = $2 LIMIT $3  [["food_id", 2], ["inventory_id", 1], ["LIMIT", 1]]